armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L1xx/Keil.STM32L1xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32L1xx_DFP</name>
  <description>STMicroelectronics STM32L1 Series Device Support and Examples</description>

  <releases>
    <release version="1.2.0" date="2016-09-21">
      Updated STM32L1xx device support files.
      Added STM32L162xE device support.
      Added STM32L100xxA device support.
      Added STM32L151xxX device support.
      Added STM32L152xxX device support.
      Added STM32L162xxX device support.
      Added STM32L162xxA device support.
      Updated documentation.
      Reworked component startup.
      Reworked examples.
    </release>
    <release version="1.1.0" date="2016-08-01">
      Fixed SVD files access attribute for DIER registers to read-write.
      Added 'boards' section.
      Reworked 'conditions', 'Startup' sections.
    </release>
    <release version="1.0.2">
      - added option byte target to STM32L-Discovery Blinky example
      - added new devices: STM32L151QE STM32L151RE STM32L151VE STM32L151ZE STM32L152QE STM32L152RE STM32L152VE STM32L152ZE
    </release>
    <release version="1.0.1">
      - added new devices
      - updated Flash Programming Algorithms
    </release>
    <release version="1.0.0">
      First Release version of STM32L1 Device Family Pack.
    </release>
  </releases>

  <devices>
    <family Dfamily="STM32L1 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
STMicroelectronics' STM32L1 series uses ultra-low-leakage process technology with a autonomous dynamic voltage scaling and 5 low-power modes offering unprecedented platform flexibility to fit any application.
Typical applications include Medical and handheld equipment, Application control and user interface, PC peripherals, gaming, GPS and sport equipment, Alarm systems, wired and wireless sensors, Video intercom, Utility metering
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="DAC"           n="2"       m="12"/>
      <feature type="I2C"           n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="Temp"          n="-40"     m="105"/>


      <!-- ************************  Subfamily 'STM32L100'  **************************** -->
      <subFamily DsubFamily="STM32L100">
        <book name="Documents/CD00240193.pdf" title="STM32L1xx Series Reference Manual"/>

        <feature type="I2S"           n="2"/>
        <feature type="USART"         n="3"       m="4000000"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>

        <!-- *************************  Device 'STM32L100C6'  ***************************** -->
        <device Dname="STM32L100C6">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xB"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078075.pdf" title="STM32L100 C6, R8, RB Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.16"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L100R8'  ***************************** -->
        <device Dname="STM32L100R8">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xB"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078075.pdf" title="STM32L100 C6, R8, RB Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L100RB'  ***************************** -->
        <device Dname="STM32L100RB">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xB"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

