armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L1xx/Keil.STM32L1xx_DFP.pdsc
      </subFamily-->

      <!-- ************************  Subfamily 'STM32L162xxA'  ************************* -->
      <subFamily DsubFamily="STM32L162xxA">
        <book name="Documents/CD00240193.pdf" title="STM32L1xx Series Reference Manual"/>

        <!-- *************************  Device 'STM32L162RCxxA'  ***************************** -->
        <device Dname="STM32L162RCxxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h"  define="STM32L162xCA"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00112716.pdf" title="STM32L162QC STM32L162VC-A, STM32L162ZC STM32L162RC-A Data Sheet"/>

          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L162VCxxA'  ***************************** -->
        <device Dname="STM32L162VCxxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L162xCA"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00112716.pdf" title="STM32L162QC STM32L162VC-A, STM32L162ZC STM32L162RC-A Data Sheet"/>

          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
        </device>
     </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L100xB">
      <description>STMicroelectronics STM32L100xB devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100C6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100R8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100RB"/>
    </condition>
    <condition id="STM32L100xBA">
      <description>STMicroelectronics STM32L100xBA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100C6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100R8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100RBxxA"/>
    </condition>
    <condition id="STM32L100xC">
      <description>STMicroelectronics STM32L100xC devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L100RC"/>
    </condition>
    <condition id="STM32L151xB">
      <description>STMicroelectronics STM32L151xB devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151C6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151C8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151CB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151R6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151R8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151V8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VB"/>
    </condition>
    <condition id="STM32L151xBA">
      <description>STMicroelectronics STM32L151xBA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151C6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151C8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151CBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151R6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151R8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151V8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VBxxA"/>
    </condition>
    <condition id="STM32L151xC">
      <description>STMicroelectronics STM32L151xC devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151CC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151UC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VC"/>
    </condition>
    <condition id="STM32L151xCA">
      <description>STMicroelectronics STM32L151xCA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RCxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VCxxA"/>
    </condition>
    <condition id="STM32L151xD">
      <description>STMicroelectronics STM32L151xD devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZD"/>
    </condition>
    <condition id="STM32L151xE">
      <description>STMicroelectronics STM32L151xE devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZE"/>
    </condition>
    <condition id="STM32L152xB">
      <description>STMicroelectronics STM32L152xB devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152CB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152V8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VB"/>
    </condition>
    <condition id="STM32L152xBA">
      <description>STMicroelectronics STM32L152xBA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152CBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152V8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VBxxA"/>
    </condition>
