armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L1xx/Keil.STM32L1xx_DFP.pdsc
    <condition id="STM32L162xC CMSIS">
      <description>STMicroelectronics STM32L162xC devices and CMSIS-Core</description>
      <require condition="STM32L162xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L162xCA CMSIS">
      <description>STMicroelectronics STM32L162xCA devices and CMSIS-Core</description>
      <require condition="STM32L162xCA"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L162xD CMSIS">
      <description>STMicroelectronics STM32L162xD devices and CMSIS-Core</description>
      <require condition="STM32L162xD"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L162xE CMSIS">
      <description>STMicroelectronics STM32L162xE devices and CMSIS-Core</description>
      <require condition="STM32L162xE"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup STM32L100xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L100xB CMSIS">
      <description>System Startup for STMicroelectronics STM32L100xB Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l100xb.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L100xBA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L100xBA CMSIS">
      <description>System Startup for STMicroelectronics STM32L100xBA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l100xba.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L100xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L100xC CMSIS">
      <description>System Startup for STMicroelectronics STM32L100xC Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l100xc.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"     attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xB CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xB Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xb.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xBA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xBA CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xBA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xba.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xC CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xC Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xc.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"     attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xCA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xCA CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xCA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xca.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xD -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xD CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xD Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xd.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_HD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L151xE -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L151xE CMSIS">
      <description>System Startup for STMicroelectronics STM32L151xE Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l151xe.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_XL_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

