armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L1xx/Keil.STM32L1xx_DFP.pdsc
  <boards>
    <!-- STM32L-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32L-Discovery" revision="Rev.B"
           salesContact="http://www.st.com/stonline/contactus/contacts/index.php"
           orderForm   ="http://www.st.com/web/en/estore">
      <description>Discovery kit with STM32L152RBT6 MCU</description>
      <image small="Boards/ST/STM32L-Discovery/Documents/STM32L-Discovery_small.jpg"
             large="Boards/ST/STM32L-Discovery/Documents/STM32L-Discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/PF250990" title="STM32L-Discovery Web Page"/>
      <book category="other"     name="Boards/ST/STM32L-Discovery/Documents/DM00027566.pdf" title="Data Brief"/>
      <book category="manual"    name="Boards/ST/STM32L-Discovery/Documents/DM00027954.pdf" title="User Manual"/>
      <book category="schematic" name="Boards/ST/STM32L-Discovery/Documents/MB963.pdf"                  title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L152RB"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L152"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="USB"       n="1"              name="User USB with Mini-B connector"/>
      <feature type="Button"    n="2"              name="User, Reset"/>
      <feature type="LCD"       n="1"  m="4.24"    name="Segment LCD"/>
      <feature type="Touch"     n="1"              name="Linear Touch Sensor or four Touch Keys"/>
      <feature type="LED"       n="4"              name="USB COM, 3.3 V Power, 2 user"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
  </boards>

  <examples>
    <!-- STM32L-Discovery Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/ST/STM32L-Discovery/Blinky">
      <description>Blinky example</description>
      <board name="STM32L-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/ST/STM32L-Discovery/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32L-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
